[
  {
    "id_qa": "GENERAL_BIENVENIDA",
    "diagnostico": "Bienvenida e Instrucciones Generales",
    "intencion_clave": "hola, que haces, ayuda, bienvenido, inicio",
    "palabras_clave": ["hola", "buenos d칤as", "ayuda", "quienes son", "bot", "buenas tardes", "holis", "alo"],
    "respuesta_validada": "춰Hola! Qu칠 bueno saludarte. Bienvenidos a nuestro chat del Equipo de Cirug칤a de Tobillo y Pie de la Mutual de Seguridad. Estamos aqu칤 para acompa침arte en esta recuperaci칩n (que sabemos requiere mucha paciencia) y recordarte los cuidados que detallamos en tu epicrisis. Cualquier duda, aqu칤 estamos para guiarte.",
    "nivel_de_urgencia": "BAJO",
    "tags": ["inicio", "general"]
  },
  {
    "id_qa": "ALERTA_GUARDRAIL_001",
    "diagnostico": "General - Se침ales de Alarma Cr칤tica",
    "intencion_clave": "fiebre, pus, dolor insoportable, sangrado abundante, me duele muchisimo, emergencia",
    "palabras_clave": ["emergencia", "fiebre", "pus", "infecci칩n", "dolor terrible", "sangrado activo", "falta aire", "se abri칩", "hueso"],
    "respuesta_validada": "游뚿 **춰ALERTA DE SEGURIDAD!** Lo que nos cuentas (como fiebre alta, pus, dolor que no cede, dificultad para respirar, hueso expuesto o sangrado activo) nos preocupa y **NO** es algo para resolver por chat. Por tu seguridad, deja el celular ahora mismo y dir칤gete al **servicio de urgencia m치s cercano** de inmediato. No pierdas tiempo intentando contactarnos, esto requiere atenci칩n presencial urgente.",
    "nivel_de_urgencia": "ALTO",
    "tags": ["emergencia", "urgencia", "red flag"]
  },
  {
    "id_qa": "MANEJO_DOLOR_EPICRISIS",
    "diagnostico": "Manejo del Dolor y Medicaci칩n",
    "intencion_clave": "manejo del dolor, me duele, que puedo tomar, pastillas, epicrisis",
    "palabras_clave": ["dolor", "analg칠sico", "receta", "dosis", "horario", "paracetamol", "tramadol", "celecoxib", "ketorolaco"],
    "respuesta_validada": "Con el dolor no hay que hacerse el valiente. Sigue estrictamente la pauta indicada en tu 'Epicrisis' (el papel de alta). Ah칤 est치n las dosis exactas pensadas para tu caso. Toma los remedios con reloj en mano; no esperes a que el dolor sea fuerte. Si a pesar de esto el dolor es insoportable, acude al servicio de urgencia m치s cercano.",
    "nivel_de_urgencia": "MEDIO",
    "tags": ["dolor", "medicacion"]
  },
  {
    "id_qa": "PROTOCOLO_FRIO_LOCAL",
    "diagnostico": "Manejo de Fr칤o Local (Hielo)",
    "intencion_clave": "hielo, frio, cuanto rato el hielo, gel pack, inflamacion",
    "palabras_clave": ["hielo", "fr칤o", "gel", "cryocuff", "inflamaci칩n", "ponerse hielo", "baja temperatura"],
    "respuesta_validada": "El fr칤o es clave para desinflamar. Apl칤cate hielo 3 veces al d칤a, por 10 minutos exactos. Puedes usar packs de gel o hielo normal, pero **SIEMPRE** envuelto en una toalla, nunca directo a la piel para no quemarte. S칠 constante con esto.",
    "nivel_de_urgencia": "BAJO",
    "tags": ["cuidados", "frio"]
  },
  {
    "id_qa": "POSTOP_HERIDA_CUIDADOS",
    "diagnostico": "Cuidado de Herida y Agua",
    "intencion_clave": "cuidado de la herida, cambio de aposito, mojar, duchar, cuando me quitan los puntos",
    "palabras_clave": ["agua", "ducha", "mojado", "ba침ar", "humedad", "herida", "puntos", "parche", "ap칩sito"],
    "respuesta_validada": "La regla de oro: ap칩sitos limpios y COMPLETAMENTE SECOS. No mojes los parches bajo ninguna circunstancia. Si te vas a duchar, protege la pierna con una bolsa pl치stica sellada con cinta adhesiva. No destapes la herida ni toques los puntos en casa; las curaciones se har치n en tu control m칠dico.",
    "nivel_de_urgencia": "MEDIO",
    "tags": ["postop", "cuidado", "higiene"]
  },
  {
    "id_qa": "LOGISTICA_RADIOGRAFIAS",
    "diagnostico": "Flujo de Atenci칩n con Radiograf칤as",
    "intencion_clave": "donde me tomo la radiografia, tengo control con rayos, llego antes",
    "palabras_clave": ["rayos", "rx", "radiograf칤a", "control", "admisi칩n", "llegada", "imagen"],
    "respuesta_validada": "Para tu control con radiograf칤as, hag치moslo eficiente: cuando llegues, avisa en admisi칩n y pasa directo a tomarte la radiograf칤a **ANTES** de entrar a la consulta. As칤, cuando entres a vernos, ya tendremos las im치genes en pantalla y no tendr치s que esperar doble. 춰Nos ayudas mucho a todos con esto!",
    "nivel_de_urgencia": "BAJO",
    "tags": ["administrativo", "control"]
  },
  {
    "id_qa": "NO_FUMAR",
    "diagnostico": "Indicaciones en relacion a Tabaquismo y/o Drogas",
    "intencion_clave": "prohibici칩n estricta de tabaco activo y pasivo",
    "palabras_clave": ["fumar", "cigarrillo", "tabaco", "fuman", "humo", "vapeador", "nicotina", "tia", "mama", "papa", "visita", "esposo", "mi familia", "fuman en casa", "vicio", "marihuana", "pito", "fumador pasivo"],
    "respuesta_validada": "La instrucci칩n es una sola: **NO FUMAR, ni de forma activa ni pasiva.**\\n\\n1. **Activo:** El cigarro cierra los vasos sangu칤neos y tu hueso NO pegar치 (pseudoartrosis).\\n2. **Pasivo:** Si tu familia o visitas fuman cerca de ti, inhalas los mismos t칩xicos y el da침o es el mismo.\\n\\n**Tu responsabilidad como paciente** es exigir un ambiente libre de humo. No culpes a tus familiares si la herida se complica o el hueso no pega por el humo en casa; t칰 debes poner el l칤mite tajante.",
    "nivel_de_urgencia": "BAJO",
    "tags": ["cuidados generales", "factores de riesgo", "retardo consolidaci칩n", "habitos"]
  },
  {
    "id_qa": "USO_BOTA_CAM",
    "diagnostico": "Uso de Bota CAM / Zapato Postop",
    "intencion_clave": "bota, dormir con bota, me puedo sacar la bota, zapato postoperatorio",
    "palabras_clave": ["bota", "cam walker", "dormir", "noche", "velcro", "ortesis", "zapato"],
    "respuesta_validada": "Respecto a la bota o zapato especial: 칔sala siempre durante el d칤a y para cualquier traslado. En la noche, para que descanses mejor, te la puedes soltar un poco (aflojar velcros), pero no te la saques completamente a menos que te lo hayamos indicado, ya que protege el pie de movimientos bruscos mientras sue침as.",
    "nivel_de_urgencia": "BAJO",
    "tags": ["ortesis", "cuidados"]
  },
  {
    "id_qa": "DESCARGA_EXTREMIDAD",
    "diagnostico": "Carga de Peso (Descarga)",
    "intencion_clave": "puedo pisar, apoyar, muletas, carga, caminar",
    "palabras_clave": ["pisar", "apoyar", "carga", "tocar suelo", "caminar", "peso", "muleta"],
    "respuesta_validada": "En general, y salvo que tu epicrisis diga otra cosa, mantenemos la indicaci칩n de 'descarga'. Esto significa **NO apoyar** el pie operado en el suelo bajo ninguna circunstancia. Usa tus muletas o andador. Apoyar antes de tiempo puede desplazar la fractura o da침ar la cirug칤a irreparablemente.",
    "nivel_de_urgencia": "ALTO",
    "tags": ["postop", "movilidad", "seguridad"]
  },
  {
    "id_qa": "SINTOMA_DOLOR_PUNZANTE",
    "diagnostico": "Dolor al bajar el pie",
    "intencion_clave": "punzada, latido, bajar la pierna, sangre a la cabeza, dolor al pararse",
    "palabras_clave": ["punzada", "latido", "bajar la pierna", "dolor al pararse", "sangre", "bajar el pie"],
    "respuesta_validada": "Te entendemos perfectamente, es una sensaci칩n muy desagradable, como si la sangre se fuera de golpe al pie. Es s칰per normal en nuestras cirug칤as de pie y tobillo porque la gravedad hace lo suyo. El truco es no bajar la pierna de golpe; si te vas a levantar, si칠ntate un momento antes y mueve los dedos para activar la circulaci칩n antes de ponerte de pie.",
    "nivel_de_urgencia": "BAJO",
    "tags": ["sintomas", "dolor"]
  },
  {
    "id_qa": "SINTOMA_DEDOS_MORADOS",
    "diagnostico": "Cambios de coloraci칩n",
    "intencion_clave": "dedos negros, dedos morados, color oscuro, cambio de color",
    "palabras_clave": ["dedos negros", "dedos morados", "color oscuro", "cambio de color", "rojo oscuro", "cianosis"],
    "respuesta_validada": "No te asustes si ves los dedos un poco m치s oscuros o morados cuando bajas el pie, es por lo mismo que habl치bamos de la gravedad y la cirug칤a reciente. Lo importante es que, al volver a poner el pie en alto sobre los cojines, recuperen su color rosadito normal en unos minutos. Si se quedan p치lidos o morados estando en alto, ah칤 s칤 debes ir al servicio de urgencia m치s cercano.",
    "nivel_de_urgencia": "MEDIO",
    "tags": ["sintomas", "circulacion"]
  },
  {
    "id_qa": "SIGNOS_TROMB
